{
  "title": "Meet the Therapist!",
  "content": "Therapy works best when the fit is right. Here, I share a bit about myself outside of session and the experiences that shaped my work as a therapist.\n\nI’m a native Texan with blue-collar roots, born and raised in H-Town (Houston). My education tells part of my story, but my journey really began when I enlisted in a combat arms role in the U.S. Army. Active duty sharpened my discipline, taught me the value of honor, and cemented GRIT as a tried-and-true principle. Being a soldier took me across the U.S. and the world, exposing me to many cultures and perspectives I carry to this day.\n\nBefore pursuing higher education, I spent years in physically demanding jobs—welder, cell tower climber, and other tough labor. These roles were tenacious yet familiar, connecting hard work with resilience and grounding me in real-world challenges. Even in those settings, I noticed a knack for listening, supporting others, and helping people work through their struggles. I realized this was a vocation, one that demanded I seek a path toward becoming a healer in a formal setting.\n\nDuring and after undergrad, I worked in social services, mostly supporting houseless military veterans. After graduate school, I moved into clinical psychotherapy at the Texas A&M Department of Psychiatry, joining an interdisciplinary team serving a rural community alongside some of the best mental health providers in the state. Currently, I’m training in Existential Analysis at the Center for Existential Analysis & Logotherapy—a lineage tracing back to Dr. Viktor Frankl himself. (Author of *Man's Search for Meaning*)\n\nMy education and career are only a fraction of who I am. Outside of therapy, I pursue two main expressions: **LEARNING** and **MOVING**. I read obsessively -- history, philosophy, mythology, comparative religion -- and I stay active through rucking, hiking, strength training, and other physical pursuits. I also chase live music, galleries, and museums, finding meaning in both cathartic release (ask me about the mosh pit as a workout for the soul) and quiet reflection. A mixed bag, sure, but as Joe Dirt once said, “Life’s a garden: dig it!”\n\n![](/images/img_20210507_110845.jpg)",
  "image": "/images/jonjon-177.jpg"
}
