{
  "heroCtaHref": "/contact",
  "heroImage": "/images/jonjon-177.jpg",
  "heroCtaText": "BOOK A FREE CONSULTATION",
  "testimonialsTitle": "What clients say",
  "aboutTitle": "Howdy. I'm Jonathan, an existential psychotherapist.",
  "aboutContent": "*I help men reconnect with who they are and build a life that actually fits.*\n\nI work with men who are navigating:\n\n* Chronic stress, burnout, or carrying too much responsibility\n* Questions of identity, direction, and what they actually want\n* The impact of trauma or unresolved past experiences\n* Anger, irritability, or difficulty regulating emotions\n* Relationship strain, emotional distance, or communication breakdowns\n* Anxiety, low mood, or feeling disconnected from themselves\n\n\n\nI work with men who feel worn down, disconnected, or stuck, often after years of carrying responsibility, stress, or trauma on their own. Many of the people I work with are used to pushing through rather than looking inward. As a U.S. Army veteran, I understand that culture firsthand. Over time, this way of living can lead to numbness, anger, or a quiet loss of self. Personal freedom requires taking a position in your own life, and I help clients do that with clarity, grit, and compassion.\n\nOur work centers on self-responsibility and understanding how past experiences shape present struggles. I help clients face what they’ve been avoiding, reconnect with their values, and respond to life with intention. \n\nIf you’re ready to stop reacting to life, understand yourself more deeply, and take intentional steps forward, I invite you to reach out. My focus is down-to-earth, principled, and geared toward helping you grow with clarity and resilience.",
  "aboutImage": "/images/jonjon-119.jpg",
  "heroSubtitle": "Support for navigating stress, healing trauma, and discovering your purpose. Accepting new clients virtually across Texas. ",
  "faqsTitle": "Frequently asked questions",
  "heroTitle": "Contemporary therapy for high-achieving men"
}
