{
  "title": "Privacy Policy",
  "lastUpdated": "2025-01-18",
  "content": "## Information We Collect\n\nWhen you use our contact form, we collect the information you provide, including your name, email address, and message content. We use Google Analytics to collect anonymous usage data about how visitors interact with our website.\n\n## How We Use Your Information\n\nWe use the information you provide through our contact form solely to respond to your inquiries about our therapy services. We do not sell, share, or distribute your personal information to third parties.\n\n## Google Analytics\n\nThis website uses Google Analytics to help us understand how visitors use our site. Google Analytics collects information such as how often users visit the site, what pages they visit, and what other sites they used prior to coming to this site. We use this information to improve our website and your experience.\n\nGoogle Analytics collects only the IP address assigned to you on the date you visit this site, rather than your name or other identifying information. We do not combine the information collected through Google Analytics with personally identifiable information.\n\nYou can opt out of Google Analytics by installing the [Google Analytics Opt-out Browser Add-on](https://tools.google.com/dlpage/gaoptout).\n\n## Cookies\n\nThis website uses cookies to remember your theme preference (light or dark mode) and for Google Analytics functionality. You can control cookies through your browser settings.\n\n## Data Security\n\nWe take reasonable precautions to protect your information. However, no method of transmission over the Internet is 100% secure.\n\n## Your Rights\n\nYou may request access to, correction of, or deletion of your personal information by contacting us directly.\n\n## Contact\n\nIf you have questions about this Privacy Policy, please contact us through our contact form.\n\n## Changes to This Policy\n\nWe may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the \"Last Updated\" date."
}
